"""
Пакетът съдържа модули, които имплементират бизнес логиката на приложението,
т.е. какво може да прави, как се очаква да се държи при еди-си-какви-си обстоятелства.

В нашия случай решихме да направим функциите "чисти" (pure) - такива без странични ефекти,
защото:
    1. да бъдат тествани по-лесно
    2. да не зависят от имплементационни детайли (JSON file-ове, print-ове, т.н.)
    3. single responsibility

В т.нар. clean architecture, такива класове/модули/функции могат обикновено се наричат Use Cases.
"""
